'use strict';

//---------------------------------------------------------------------------------------------------//
// Устаревшие методы, но ещё встречаются в проектах.
//---------------------------------------------------------------------------------------------------//
// ID
const box777 = document.getElementById('box'); //сначала обращаемся к документу (объект).
// С помощью метода .getElementById() получаем эемент страницы с ID = box.
console.log(box777);

//---------------------------------------------------------------------------------------------------//
// Tags
const btns = document.getElementsByTagName('button');
// Важно. Получаем не один элемент, а массив данных - псевдомассив.
console.log(btns);

// Чтобы получить конкретныую кнопку, нужно указать индекс. Способ 1.
const btns1 = document.getElementsByTagName('button')[1];
console.log(btns1);

// Чтобы получить конкретныую кнопку, нужно указать индекс. Способ 1.
const btns2 = document.getElementsByTagName('button');
console.log(btns2[2]);

//---------------------------------------------------------------------------------------------------//
//Class
const circle777 = document.getElementsByClassName('circle');
console.log(circle777);

//---------------------------------------------------------------------------------------------------//
// Современные методы.
//---------------------------------------------------------------------------------------------------//
// CSS-селекторы.
const hearts = document.querySelectorAll('.heart');
// для селектора указывается точка. В случа рыботы с .querySelectorAll(). А для ID #.
// дополнительный + этого метода - появляется методв .forEach.
// console.log(hearts);
hearts.forEach(item => {
    console.log(item);
}); // поочерёдно перебрать все элементы массива. item - каждый элемент, который содержится в массиве.

//один селектор, первый элемент.
const oneHeart = document.querySelector('.heart');
console.log(oneHeart);